Repository: AntonioEmanueleCutarella98/TheSign
Catalog: TheSign/*.lproj/Localizable.strings
Languages: it

# Tables1
source: A table presents data as a single-column scrolling row list that can be divided into sections or groups. We use a table to display large or small amounts of information cleanly and efficiently in the form of a list, in general, tables are ideal for text-based content and often appear as a means of navigation on one side of a split view, with the related content shown on the opposite side. Plain, Rows can be separated into labeled sections and an optional index can be displayed vertically along the right edge of the table. A header can appear before the first element of a section and a footer after the last element.
it: Una tabella presenta i dati come un elenco di righe a scorrimento a colonna singola che può essere suddiviso in sezioni o gruppi. Utilizziamo una tabella per visualizzare grandi o piccole quantità di informazioni in modo pulito ed efficiente sotto forma di un elenco, in generale , le tabelle sono ideali per il contenuto di testo e spesso appaiono come mezzo di navigazione su un lato di una vista divisa, con il relativo contenuto mostrato sul lato opposto. Semplice, le righe possono essere separate in sezioni etichettate e un indice facoltativo può essere visualizzato verticalmente lungo il bordo destro della tabella. Un'intestazione può apparire prima del primo elemento di una sezione e un piè di pagina dopo l'ultimo elemento.

# Tables2
source: Grouped, Rows are displayed in groups, which can be preceded by a header and followed by a footer. This table style always contains at least one group, and each group always contains at least one row. A grouped table does not include an index.
it: Raggruppate, le righe vengono visualizzate in gruppi, che possono essere preceduti da un'intestazione e seguiti da un piè di pagina. Questo stile di tabella contiene sempre almeno un gruppo e ogni gruppo contiene sempre almeno una riga. Una tabella raggruppata lo fa non includere un indice.

# Tables3
source: Inset Grouped, Rows are displayed in groups with rounded corners and indents relative to the edges of the main view. This table style always contains at least one group and each group always contains at least one row and can be preceded by a header and followed by a footer. An inset grouped table does not include an index. The inset grouped style works best in a regular-width environment. Since there is less space in a compact environment, an inset grouped table can cause text to wrap, especially when the content is localized.
it: Riquadro raggruppato, le righe vengono visualizzate in gruppi con angoli arrotondati e rientri relativi ai bordi della vista principale. Questo stile di tabella contiene sempre almeno un gruppo e ogni gruppo contiene sempre almeno una riga e può essere preceduto da un'intestazione e seguito da un piè di pagina. Una tabella raggruppata inset non include un indice. Lo stile raggruppato inset funziona meglio in un ambiente di larghezza regolare. Poiché c'è meno spazio in un ambiente compatto, una tabella raggruppata inset può causare il ritorno a capo del testo , soprattutto quando il contenuto è localizzato.

# Tables4
source: Standard table cell styles are used to define how content is displayed in table rows. Basic (Default), an optional image on the left side of the line, followed by a left-aligned title. This is a good option for displaying items that do not require additional information.
it: Gli stili di cella della tabella standard vengono utilizzati per definire la modalità di visualizzazione del contenuto nelle righe della tabella. Di base (impostazione predefinita), un'immagine facoltativa sul lato sinistro della riga, seguita da un titolo allineato a sinistra. Questa è una buona opzione per la visualizzazione di elementi che non richiedono informazioni aggiuntive.

# Tables5
source: Subtitle, a left-aligned title on one line and a left-aligned subtitle on the next. This style works well in a table where the rows are visually similar. The additional subtitle helps distinguish the lines from each other. Right Detail, a left-aligned title with a right-aligned subtitle on the same line and also Left Detail, a right-aligned title, followed by a left-aligned subtitle on the same line. All standard table cell styles also allow graphic elements, such as a check mark or a disclosure indicator, naturally adding these elements decreases the space available for titles and subtitles.
it: Sottotitolo, un titolo allineato a sinistra su una riga e un sottotitolo allineato a sinistra su quella successiva. Questo stile funziona bene in una tabella in cui le righe sono visivamente simili. Il sottotitolo aggiuntivo aiuta a distinguere le righe l'una dall'altra. Right Detail, un titolo allineato a sinistra con un sottotitolo allineato a destra sulla stessa riga e anche Left Detail, un titolo allineato a destra, seguito da un sottotitolo allineato a sinistra sulla stessa riga. Tutti gli stili di cella di tabella standard consentono anche elementi grafici , come un segno di spunta o un indicatore di divulgazione, naturalmente l'aggiunta di questi elementi diminuisce lo spazio disponibile per titoli e sottotitoli.

# Tables6
source: We keep the text concise to avoid clipping. Truncated words and sentences are difficult to scan. Text truncation is automatic in all table cell styles but can present problems depending on the cell style used and where the truncation occurs. Consider using a custom title for a Delete button. If a row supports deletion and helps provide clarity, replace the system-provided Delete title with a custom title. We provide feedback when a selection is made. People expect a line to be highlighted briefly when its content is tapped. We design a custom table cell style for non-standard table rows. Standard styles are ideal for use in a variety of common scenarios, but some content or the overall app design may require a heavily customized table look.
it: Manteniamo il testo conciso per evitare il ritaglio. Le parole e le frasi troncate sono difficili da scansionare. Il troncamento del testo è automatico in tutti gli stili di cella della tabella, ma può presentare problemi a seconda dello stile di cella utilizzato e del punto in cui si verifica il troncamento. Considerare l'utilizzo un titolo personalizzato per un pulsante Elimina. Se una riga supporta l'eliminazione e aiuta a fornire chiarezza, sostituisci il titolo Elimina fornito dal sistema con un titolo personalizzato. Forniamo feedback quando viene effettuata una selezione. Le persone si aspettano che una riga venga evidenziata brevemente quando il suo contenuto è toccato. Progettiamo uno stile di cella di tabella personalizzato per righe di tabella non standard. Gli stili standard sono ideali per l'uso in una varietà di scenari comuni, ma alcuni contenuti o il design generale dell'app potrebbero richiedere un aspetto della tabella fortemente personalizzato.

# Scroll_views1
source: A scrolling view gives the user the ability to browse content, such as text in a document or a collection of images that is larger than the visible area. A scrolling view has no appearance in itself but shows temporary scroll indicators when the user interacts with it. Support zoom behavior appropriately. If it makes sense in your app, let the user pinch or double-tap to zoom in and out. When we enable zoom, it sets the maximum and minimum scale values that make sense. Let's consider showing a page control element when a scroll view is in paging mode. A page control shows how many pages are available and indicates which is currently visible. We do not place a scrolling view inside another scrolling view. Generally display one Scroll Views at a time. People often make large swiping gestures when swiping, and it can be difficult to avoid interacting with a nearby swipe view on the same screen. If we have to insert two scroll views on one screen, we consider allowing the user to scroll in different directions so that a gesture is less likely to affect both views.
it: Una visualizzazione a scorrimento da la possibilità all’utente di sfogliare il contenuto, come il testo in un documento o una raccolta di immagini che è più grande dell’area visibile. Una vista a scorrimento non ha aspetto in sé ma mostra indicatori di scorrimento temporanei quando l’utente interagisce con essa. Supporta il comportamento dello zoom in modo appropriato. Se ha senso nella tua app, lascia che l’utente pizzichino o tocchino due volte per ingrandire e rimpicciolire. Quando abilitiamo lo zoom, imposta i valori di scala massimi e minimi che hanno senso. Prendiamo in considerazione la possibilità di mostrare un elemento di controllo della pagina quando una visualizzazione a scorrimento è in modalità di paging. Un controllo di pagina mostra quante pagine sono disponibili e indica quale è attualmente visibile. Non posizioniamo una vista a scorrimento all'interno di un'altra vista a scorrimento. In generale visualizzare una Scroll Views alla volta. Le persone spesso fanno grandi gesti di scorrimento durante lo scorrimento e può essere difficile evitare di interagire con una vista di scorrimento vicina sullo stesso schermo. Se dobbiamo inserire due visualizzazioni di scorrimento su uno schermo, consideriamo di consentire all’utente di scorrere in direzioni diverse in modo che un gesto abbia meno probabilità di influire su entrambe le visualizzazioni.

# Pages1
source: A page view controller provides a way to implement linear navigation between pages of content, for example in a document, book, notebook, or calendar. A page view controller uses one of the two styles to handle transitions between pages while browsing: page scroll or curl. A scroll transition does not look specific; pages flow smoothly from one to the other. A page curl transition causes pages curl as you scroll the screen, turning like the pages of a physical book. If appropriate, implement a way to navigate non-linearly. When using a page view controller, pages scroll sequentially and there is no way to jump from page to page. people may need to access pages out of sequence in the app, implement a custom control that provides this functionality.
it: Un controller di visualizzazione della pagina fornisce un modo per implementare la navigazione lineare tra le pagine di contenuto, ad esempio in un documento, un libro, un blocco note o un calendario. Un controller di visualizzazione della pagina utilizza uno dei due stili per gestire le transizioni tra le pagine durante la navigazione: scorrimento o arricciatura della pagina. Una transizione di scorrimento non ha un aspetto specifico; le pagine scorrono fluidamente da una all'altra. Una transizione di arricciatura della pagina fa sì che le pagine si arriccino mentre scorri lo schermo, girando come le pagine di un libro fisico. Se appropriato, implementa un modo per navigare in modo non lineare. Quando si utilizza un controller di visualizzazione della pagina, le pagine scorrono in sequenza e non c'è modo di passare da una pagina all'altra. Se le persone potrebbero dover accedere alle pagine fuori sequenza nell'app, implementa un controllo personalizzato che fornisce questa funzionalità.

# Alerts1
source: Alerts convey important information about the status of your app or device. An alert consists of a title, an optional message. Apart from these configurable elements, you cannot customize the visual appearance. We minimize the alerts as alerts disrupt the user experience. We use an action sheet, not an alert, to offer choices related to an intentional action. For example, when people cancel the email they are editing, a action sheet offers three choices: discard changes (or the entire draft), save the draft, or return to editing. We avoid scrolling through alerts whenever possible.
it: Gli avvisi trasmettono informazioni importanti relative allo stato della tua app o del tuo dispositivo. Un avviso è formato da un titolo, un messaggio facoltativo. A parte questi elementi configurabili non puoi personalizzare l’aspetto visivo. Riduciamo al minimo gli avvisi dato che gli avvisi interrompono l’’esperienza dell’utente. Utilizziamo un sheet di azione, non un avviso, per offrire scelte relative a un'azione intenzionale. Ad esempio, quando le persone annullano il messaggio di posta che stanno modificando, un sheet di azione offre tre scelte: eliminare le modifiche (o l'intera bozza), salvare la bozza o tornare alla modifica. Evitiamo di scorrere gli avvisi quando possibile.

# Alerts2
source: We write short, descriptive, multi-word alert titles. Less text is generally more, single word titles rarely provide enough information. We always try to create a title that sufficiently describes the situation without having need additional message text. If the title is a complete sentence, use sentence-style capitalization and final punctuation. If we need to provide a message, write short, complete sentences. Create a message short enough to contain a line or two in so people don't have to scroll. He's straightforward and uses a neutral, approachable tone. Let's avoid explaining the alert buttons. If the alert text and button titles are clear, there's no need to explain what the buttons do.
it: Scriviamo titoli di avviso brevi, descrittivi e composti da più parole. Meno testo sia generalmente meglio, i titoli di una sola parola raramente forniscono informazioni sufficienti. Cerchiamo sempre di creare un titolo che descriva in modo sufficiente la situazione senza aver bisogno di testo del messaggio aggiuntivo. Se il titolo è una frase completa, usa la maiuscola in stile frase e la punteggiatura finale. Se dobbiamo fornire un messaggio, scrivi frasi brevi e complete. Crea un messaggio abbastanza breve da contenere una o due righe in modo che le persone non debbano scorrere. Si diretto e usa un tono neutro e accessibile. Evitiamo di spiegare i pulsanti di avviso. Se il testo dell'avviso e i titoli dei pulsanti sono chiari, non è necessario spiegare cosa fanno i pulsanti.

# Alerts3
source: Create concise and logical button titles. Aim for a one- or two-word title that describes the result of clicking the button. Prefer verbs and verbal phrases that relate directly to the title and message of the alert . Use OK for simple acceptance and avoid using Yes and No. Always use Cancel to assign a title to a button that cancels the alert action. We place the buttons where people expect them. In a classic two-way alert buttons, the button people are most likely to touch is on the bottom side and the Cancel button is on the top side. We identify destructive buttons. If an alert button causes a destructive action, such as deleting content, use the destructive button style to ensure that the system displays it appropriately.
it: Crea titoli di pulsanti concisi e logici. Punta a un titolo di una o due parole che descriva il risultato della selezione del pulsante. Preferisci i verbi e le frasi verbali che si riferiscono direttamente al titolo e al messaggio dell'avviso.Usa OK per una semplice accettazione ed evita di usare Sì e No. Usa sempre Annulla per assegnare un titolo a un pulsante che annulla l'azione dell'avviso. Posizioniamo i pulsanti dove le persone se li aspettano. In un classico avviso a due pulsanti, il pulsante che è più probabile che le persone tocchino si trova sul lato finale e il pulsante Annulla si trova sul lato iniziale. Identifichiamo i pulsanti distruttivi. Se un pulsante di avviso determina un'azione distruttiva, come l'eliminazione di contenuto, utilizzare lo stile del pulsante distruttivo per garantire che il sistema lo visualizzi in modo appropriato.

# Image_views1
source: An Image View displays a single image or an animated sequence of images on a transparent or opaque background. Within an Image View, images can be stretched, resized, resized to fit or pinned to a specific location . Image views are not interactive by default. If possible, make sure that all images in an animated sequence are consistent in size. Ideally, images should be pre-scaled to fit the view so that the system does not need to resize. If the system needs to resize , it is easier to achieve the desired results when all images are the same size and shape.
it: Una visualizzazione immagine visualizza una singola immagine o una sequenza animata di immagini su uno sfondo trasparente o opaco. All'interno di una visualizzazione immagine, le immagini possono essere allungate, ridimensionate, ridimensionate per adattarle o fissate in una posizione specifica. Le visualizzazioni delle immagini non sono interattive per impostazione predefinita. Se possibile, assicurati che tutte le immagini in una sequenza animata abbiano dimensioni coerenti. Idealmente, le immagini dovrebbero essere prescalate per adattarsi alla vista in modo che il sistema non debba eseguire alcun ridimensionamento. Se il sistema deve eseguire il ridimensionamento, è più facile ottenere i risultati desiderati quando tutte le immagini hanno le stesse dimensioni e forma.

# Collections
source: A collection manages an ordered set of content, such as a set of photos, and presents it in a customizable, visual layout. In general, collections are ideal for displaying image-based content. Backgrounds and other views can be optionally implemented to visually distinguish subsets of elements. We avoid creating radical new designs when a standard row or grid layout is sufficient. A collection should enhance the user experience, not become the center of attention. If it is difficult to touch an element in the collection, people may feel uncomfortable and will lose interest before they get to the content they want. We consider using a table instead of a collection for text. We take care when making layout changes, the layout of a Collection it can be changed at any time.
it: Una raccolta gestisce un insieme ordinato di contenuti, come un insieme di foto, e lo presenta in un layout personalizzabile e visivo. In generale, le raccolte sono ideali per mostrare contenuti basati su immagini. Gli sfondi e altre viste possono essere implementate facoltativamente per distinguere visivamente sottoinsiemi di elementi. Evitiamo di creare nuovi progetti radicali quando è sufficiente una riga standard o un layout a griglia. Una collection dovrebbe migliorare l'esperienza dell'utente, non diventare il centro dell'attenzione. Se è difficile toccare un elemento nella raccolta, le persone si possono sentire disagio e perderanno interesse prima di raggiungere il contenuto che desiderano. Prendiamo in considerazione l'utilizzo di una tabella invece di una raccolta per il testo. Prestiamo attenzione quando si apportano modifiche al layout, il layout di una Collection può essere modificato in qualsiasi momento.

# Activity_view1
source: An Activity View is an activity such as Copy, Favorite, Find etc. The activities are managed by an activity view that appears to us as a sheet according to the device we are using, we use the activities to give the possibility to user to access services or activities that your app can perform. The system provides us with a variety of activities including Messages, AirPlay, Print, these activities always appear first in the activity views and cannot be reordered.
it: Un Activity View è un attività come Copia, Preferito, Trova ecc. Le attività sono gestite da una visualizzazione attività che ci appare come un sheet in base al dispositivo che stiamo utilizzando, utilizziamo le attività per dare la possibilità all’utente di accedere a servizi o attività che la tua app può eseguire. Il sistema ci fornisce una serie di attività tra cui Messaggi, AirPlay, Stampa, queste attività vengono sempre visualizzate per prime nelle visualizzazioni attività e non possono essere riordinate.

# Activity_view2
source: Design simple images to represent your custom activities, a template image uses a mask to create an icon. The images must be centered in an area of ​​approximately 70 px X 70 px, remember to use white and black with transparency. Create activity titles that succinctly describe your tasks. Titles appear below icons in an activity view. Make sure the activities are appropriate to the current context, for example on pages that cannot be printed we must exclude the print activity, to access the activities just use the Action button.
it: Progetta semplici immagini per rappresentare le tue attività personalizzate, un’immagine modello utilizza una maschera per creare un’icona. Le immagine devono essere centrate in un’area di circa 70 px X 70 px, ricordiamo di usare il bianco e nero con la trasparenza. Crea titoli di attività che descrivono sinteticamente i tuoi compiti. I titoli vengono visualizzati sotto le icone in una vista attività. Assicuriamoci che le attività siano appropriate al contesto attuale, ad esempio nelle pagine che non è possibile stampare dobbiamo escludere l’attività stampa, per accedere alle attività basta utilizzare il pulsante Azione.

# Action_sheet
source: The action sheets are used for at least two options relating to the action that users have chosen; these must have a Cancel button that give the option to people to refuse an action that could destroy data. It is useful to show the destructive choices visible with strong colors such as red and it is advisable to avoid letting an action sheet scroll, as it would then be difficult to press the buttons related to it. On smaller screens, an action sheet rises from the bottom of the screen.
it: Gli action sheet si usano per almeno due opzioni relative all’azione che gli utenti hanno scelto; questi devono avere un pulsante “Annulla” che danno l’opzione alle persone di rifiutare un azione che possa distruggere dati. E’ utile mostrare le scelte distruttive visibili con colori forti come il rosso ed è consigliabile evitare di lasciare un action sheet scrollare, siccome poi sarebbe difficile premere i bottoni ad essa relativi. Sugli schermi più piccoli, un action sheet sale dal fondo dello schermo.

# Buttons1
source: The system offers standard but still customizable buttons; they exist for Activate / Deactivate and retractable. The system offers 4 different styles of buttons that give different visual characteristics each of them in 3 different sizes. It is possible to configure a button in style and size. Angles are applied directly to the sides and the app color is given, however it is possible to use the system choices. When creating a button, a SYMBOL or a text is preferable, in both cases, which anticipate or in any case not intuit the action of the key; it is preferable that the text begins with a verb that summarizes the action.
it: Il sistema offre pulsanti standard ma comunque personalizzabili; esistono per Attiva/Disattiva e retrattili. Il sistema offre 4 diversi stili di pulsanti che conferiscono caratteristiche visive diverse ciascuno in 3 diverse dimensioni. È possibile configurare un pulsante nello stile e nella dimensione.Gli angoli vengono applicati direttamente ai lati e viene fornito il colore dell'app, tuttavia è possibile utilizzare le scelte di sistema.Nella creazione di un pulsante è preferibile un SIMBOLO o un testo, in entrambi i casi, che anticipi o in ogni caso non intuire l'azione della chiave; è preferibile che il testo inizi con un verbo che riassume l'azione.
