Repository: AntonioEmanueleCutarella98/TheSign
Catalog: TheSign/*.lproj/Localizable.strings
Languages: it

# TabBar1
source: Tab bars can be found at the bottom of the screen, it helps people understand the types of information or features provided by an app, the tabs allow the user to switch from one section to another.By default a Tab Bars is translucent. Depending on the size of the device, the number of visible tabs may be less than the total number of tabs.Use the Tab Bars of the tabs only to enable navigation and not to help people perform actions.We avoid hiding the Tab Bars when the user navigates to areas other than the app, the tab bars is a global navigation control for your app so we have to make sure it is always visible, the only exception is the Tab Bars inside of a modal view since a modal view offers the user a separate experience.
it: Le barre degli strumenti si trovano nella parte inferiore dello schermo, aiutano le persone a comprendere i tipi di informazioni o funzionalità fornite da un'app, le schede consentono all'utente di passare da una sezione all'altra. Per impostazione predefinita, le barre delle schede sono traslucide. A seconda in base alle dimensioni del dispositivo, il numero di schede visibili può essere inferiore al numero totale di schede. Utilizza le barre delle schede delle schede solo per abilitare la navigazione e non per aiutare le persone a eseguire azioni. Barre quando l'utente naviga in aree diverse da l'app, le barre delle schede sono un controllo di navigazione globale per la tua app, quindi dobbiamo assicurarci che sia sempre visibile, l'unica eccezione sono le barre delle schede all'interno di una visualizzazione modale poiché una visualizzazione modale offre all'utente un'esperienza separata.

# TabBar2
source: Avoid removing or disabling a tab when its content is not available.If tabs are enabled in some cases but not others, the app interface may appear unstable and unpredictable.Consider using SF symbols to provide scalable and visually consistent tab bar elements. When using SF symbols, the elements of the tab bar automatically adapt to different contexts. If you need to create your own tab bar glyphs, create each glyph in two dimensions so that the tab bar looks good in both normal and compact environments.
it: Evita di rimuovere o disabilitare una scheda quando il suo contenuto non è disponibile.Se le schede sono abilitate in alcuni casi ma non in altri, l'interfaccia dell'app potrebbe apparire instabile e imprevedibile. Considera l'utilizzo dei simboli SF per fornire elementi della TabBar scalabili e visivamente coerenti. Quando si utilizzano i simboli SF, gli elementi della TabBar si adattano automaticamente a contesti diversi. Se devi creare i tuoi glifi della TabBar, crea ciascun glifo in due dimensioni in modo che la TabBar appaia bene sia in ambienti normali che compatti.

# Toolbar1
source: The Toolbar appears at the bottom of the screen and contains buttons to perform actions related to the current view, by default the toolbar is translucent. The toolbar hides the keyboard and on the screen. A toolbar provides a prominent and consistent location for frequently used commands, if you need to provide a way to change context, consider using a tab bar instead.
it: La Toolbar viene visualizzata nella parte inferiore dello schermo e contiene pulsanti per eseguire azioni relative alla vista corrente, per impostazione predefinita la Toolbar è traslucida. La Toolbar nasconde la tastiera e sullo schermo. Una Toolbar fornisce un posizione per i comandi utilizzati di frequente, se è necessario fornire un modo per modificare il contesto, considerare l'utilizzo di una TabBar.

# Toolbar2
source: In a toolbar that contains three or fewer buttons we must consider using concise text titles for greater clarity. In a toolbar with more than three buttons, consider using SF symbols to save space. Symbols SF offers a wide range of customizable symbols that you can use to represent actions in your app, check the Glyphs for directions.
it: In una Toolbar che contiene tre o meno pulsanti, dobbiamo considerare l'utilizzo di titoli di testo concisi per maggiore chiarezza. In una Toolbar con più di tre pulsanti, considerare l'utilizzo di simboli SF per risparmiare spazio. Simboli SF offre un'ampia gamma di opzioni personalizzabili simboli che puoi utilizzare per rappresentare le azioni nella tua app, controlla i glifi per le indicazioni stradali.

# SearchBar
source: The Search Bar allows people to search faster in a large collection. The bar needs to implement the Delete button to allow us to delete the content. We need to enable the cancel button when appropriate, which allows us to terminate the search immediately.
it: La SearchBar consente alle persone di cercare più velocemente in una vasta raccolta. La barra deve implementare il pulsante Elimina per consentirci di eliminare il contenuto. Dobbiamo abilitare il pulsante Annulla quando appropriato, il che ci consente di terminare immediatamente la ricerca.

# status_bar1
source: The Status Bars can be found along the upper edge of the screen and shows information about the battery status, the telephone operator, the time, etc. By default the background of the Status Bars is transparent, we must always keep the status bars legible and we must not put a content behind that implies interactivity.
it: Le Status Bar si trovano lungo il bordo superiore dello schermo e mostrano informazioni sullo stato della batteria, l'operatore telefonico, l'ora, ecc. Per impostazione predefinita lo sfondo delle barre di stato è trasparente, dobbiamo sempre mantenere le barre di stato leggibili e non dobbiamo mettere dietro un contenuto che implichi l'interattività.

# status_bar2
source: There are several common techniques to hide content under the status bar like: Using a navigation bar in your app, which automatically displays a status bar background and ensures that content doesn't appear below the status bar; Displaying a custom image, such as a gradient or solid color, behind the status bar and placing a blurry view behind the status bar.
it: Esistono diverse tecniche comuni per nascondere i contenuti sotto la Status Bar, come: utilizzare una Navigation Bar nell'app, che visualizza automaticamente uno sfondo della Status Bar e assicura che il contenuto non venga visualizzato sotto la Status Bar; visualizzare un'immagine personalizzata, ad esempio una sfumatura o un colore a tinta unita, dietro la Status Bar e posizionando una vista sfocata dietro la Status Bar

# navigation_bar1
source: The navigation bars are found at the top of an app and allows us to navigate on a series of screens.On the left side we can find the back button, often it can also be called as the previous screen, the right side can contain a button like Edit or End. Consideration should be given to temporarily hiding the navigation bar when viewing full screen content such as photos.
it: Le barre di navigazione si trovano nella parte superiore di un'app e ci permettono di navigare su una serie di schermate. Sul lato sinistro troviamo il pulsante Indietro, spesso può anche essere chiamato come la schermata precedente, il lato destro può contenere un pulsante come Modifica o Fine. È necessario prendere in considerazione la possibilità di nascondere temporaneamente la Navigation Bar durante la visualizzazione di contenuti a schermo intero come le foto.

# navigation_bar2
source: In most cases, the title helps people understand what they are looking at. If we want to give more emphasis to the context we have to use a large title, in some apps it helps to orient people during the search navigation.In a tabbed layout, large headings can help clarify the active tab. In iOS 13 and later, a large title navigation does not include a background or a shadow by default, and a large title scrolling through the content becomes a standard title.
it: Nella maggior parte dei casi, il titolo aiuta le persone a capire cosa stanno guardando. Se vogliamo dare più enfasi al contesto dobbiamo usare un titolo grande, in alcune app aiuta a orientare le persone durante la navigazione di ricerca. In un layout a schede, i titoli grandi possono aiutare a chiarire la scheda attiva. In iOS 13 e versioni successive, una navigazione del titolo di grandi dimensioni non include uno sfondo o un'ombra per impostazione predefinita e un titolo di grandi dimensioni che scorre il contenuto diventa un titolo standard.

# navigation_bar3
source: The navigation bar control allows people to search faster in a large collection. We can find navigation bar control by itself, in a navigation bar or in a content view. In the navigation bar we have to implement the Delete button which allows us to delete the content. We need to enable the Cancel button when appropriate, which allows us to terminate the search immediately.
it: Il controllo della Navigation Bar consente alle persone di cercare più velocemente in una raccolta di grandi dimensioni. Possiamo trovare il controllo della Navigation Bar da solo, in una Navigation Bar o in una visualizzazione del contenuto. Nella Navigation Bar dobbiamo implementare il pulsante Elimina che ci consente di eliminare il contenuto. Dobbiamo abilitare il pulsante Annulla quando appropriato, il che ci consente di terminare immediatamente la ricerca.

# Web_view
source: A web view loads and displays rich web content, such as embedded HTML and websites, directly within the app. Mail uses a web view, for example, to show HTML content in messages. Enable back and forth navigation when appropriate. Web views support forward and backward browsing, but this behavior is disabled by default. If people will be using your web view to visit multiple pages, enable back and forth navigation and provide corresponding controls to launch these features. Avoid using a web view to create a web browser. Using a web view to allow people to briefly access a website without leaving the context of your app is fine, but Safari is the primary way people surf the web on iOS. Attempting to replicate Safari functionality in your app is unnecessary and not recommended.
it: Una visualizzazione Web carica e visualizza contenuti Web avanzati, come HTML incorporato e siti Web, direttamente all'interno dell'app. Mail utilizza una visualizzazione Web, ad esempio, per mostrare il contenuto HTML nei messaggi. Abilita la navigazione avanti e indietro quando appropriato. Le visualizzazioni Web supportano la navigazione avanti e indietro, ma questo comportamento è disabilitato per impostazione predefinita. Se le persone utilizzeranno la tua visualizzazione web per visitare più pagine, abilita la navigazione avanti e indietro e fornisci i controlli corrispondenti per avviare queste funzionalità. Evitare di utilizzare una visualizzazione Web per creare un browser Web. L'utilizzo di una visualizzazione Web per consentire alle persone di accedere brevemente a un sito Web senza uscire dal contesto della tua app va bene, ma Safari è il modo principale in cui le persone navigano sul Web su iOS. Il tentativo di replicare la funzionalità di Safari nella tua app non è necessario e sconsigliato.

# Text_view
source: A text view displays styled multiline text content. Text views can be of any height and allow scrolling when the content extends out of the view. By default, content within a text view is left aligned and uses the black system font. If a text view is editable, a keyboard appears when you tap inside the view. Keep the text legible. While you can use multiple fonts, colors, and alignments in creative ways, maintaining the readability of your content is essential. It's a good idea to adopt the dynamic type so that your text still looks good if people change the size of the text on their device. You should also test your content with accessibility options enabled, such as bold text. Shows the appropriate keyboard type. iOS provides several types of keyboards, each designed to facilitate a different type of input. To make data entry easier, the keyboard displayed when editing a text view should be appropriate for the type of content in the field.
it: Una vista testo mostra contenuto di testo multilinea con stile. Le visualizzazioni del testo possono essere di qualsiasi altezza e consentire lo scorrimento quando il contenuto si estende al di fuori della visualizzazione. Per impostazione predefinita, il contenuto all'interno di una visualizzazione testo è allineato a sinistra e utilizza il carattere di sistema in nero. Se una visualizzazione di testo è modificabile, quando si tocca all'interno della visualizzazione viene visualizzata una tastiera. Mantieni il testo leggibile. Sebbene tu possa utilizzare più caratteri, colori e allineamenti in modi creativi, è essenziale mantenere la leggibilità dei tuoi contenuti. È una buona idea adottare il tipo dinamico in modo che il tuo testo abbia ancora un bell'aspetto se le persone cambiano la dimensione del testo sul proprio dispositivo. Dovresti anche testare i tuoi contenuti con le opzioni di accessibilità abilitate, come il testo in grassetto. Mostra il tipo di tastiera appropriato. iOS fornisce diversi tipi di tastiera, ciascuno progettato per facilitare un diverso tipo di input. Per semplificare l'immissione dei dati, la tastiera visualizzata durante la modifica di una visualizzazione di testo dovrebbe essere adeguata al tipo di contenuto nel campo.

# Interface_essentials1
source: Most of the IOS apps use elements of UIKit which is a framework that gives the apps a coherent aspect ensuring customization and ADAPTABILITY to all IOS devices.The main categories of UIKit elements are Bars: indicate where your app is in the navigation and may contain keys that initiate communication. Views : contain the main elements of the app such as text, graphics and interactive elements and lastly Controls , which are used to act or transmit information; buttons and switches are controls.
it: La maggior parte delle app IOS utilizza elementi di UIKit, un framework che conferisce alle app un aspetto coerente garantendo personalizzazione e ADATTABILITÀ a tutti i dispositivi IOS. Le categorie principali di elementi UIKit sono Barre: indica dove si trova la tua app nella navigazione e potrebbe contenere chiavi che avviano la comunicazione. Viste: contengono gli elementi principali dell'app come testo, grafica ed elementi interattivi e infine i Controlli, utilizzati per agire o trasmettere informazioni; pulsanti e interruttori sono controlli.

# Themes1
source: 3 main differences between iOS and other platforms are Clarity: the text is legible at any size; WHITE SPACES, colors and graphics are aimed at interaction. Deference: the FLUIDITY in the interface guarantees that those who use the app are never in competition with it; it is also important to use shadows and shades to a minimum so that you can dare to give importance to the content and Depth: the use of realistic gestures favors navigation and allows the user to directly view the HIERARCHY of the contents; the use of adequate transitions adequate DEPTH to the text Design principles: Contribute to the app identity. Aesthetic integrity: refers to how well the appearance of an app is in accord with its function: for example an app that helps people to be focused will have a discreet design, while a video game will surely have an attractive design so that one can be definitely encouraged to play with it. Consistency: a consistent app uses icons, text styles that are well known and are FAMILIAR with the user. Direct manipulation: it facilitates the user in navigation and ensures that you can have IMMEDIATE FEEDBACK of an action performed, an example is when you rotate the screen. Feedback: the use of sounds or highlighting of elements before they are used means that there is a perceptible feedback from the user. Metaphors: People learn faster with actions they may be familiar with and User control: an app must find the right balance between user freedom and avoid unwanted outcomes, to do this it is essential to have a CLEAR and INTUITIVE interface.
it: 3 differenze principali tra iOS e le altre piattaforme sono Clarity: il testo è leggibile in qualsiasi dimensione; SPAZI BIANCHI, colori e grafica sono finalizzati all'interazione, Deferenza: la FLUIDITÀ nell'interfaccia garantisce che chi usa l'app non sia mai in concorrenza con essa; è importante anche utilizzare ombre e sfumature al minimo in modo da poter osare dare importanza al contenuto e Profondità: l'uso di gesti realistici favorisce la navigazione e consente all'utente di visualizzare direttamente la GERARCHIA dei contenuti; l'utilizzo di transizioni adeguate APPROFONDITA al testo Principi di progettazione: Contribuire all'identità dell'app. Integrità estetica: si riferisce a quanto bene l'aspetto di un'app è in accordo con la sua funzione: ad esempio un'app che aiuta le persone a concentrarsi avrà un design discreto, mentre un videogioco avrà sicuramente un design accattivante in modo che si possa essere decisamente incoraggiati a giocarci. Coerenza: un'app coerente utilizza icone, stili di testo noti e FAMILIARI con l'utente. Manipolazione diretta: facilita la navigazione dell'utente e garantisce che tu possa avere un FEEDBACK IMMEDIATO di un'azione eseguita, un esempio è quando ruoti lo schermo. Feedback: l'uso di suoni o l'evidenziazione di elementi prima che vengano utilizzati significa che c'è un feedback percepibile da parte dell'utente. Metafore: le persone imparano più velocemente con le azioni che potrebbero conoscere e il controllo dell'utente: un'app deve trovare il giusto equilibrio tra la libertà dell'utente ed evitare esiti indesiderati, per farlo è fondamentale avere un'interfaccia CHIARA e INTUITIVA.

# Sheets1
source: A sheet helps people perform a separate activity related to the parent view without taking them out of the current context. For example, Mail uses a sheet to help people compose an email without leaving their inbox. A sheet appears as a tab that includes the underlying content. The top corners of the card are rounded to visually distinguish it from the main view, we can customize the corner radius of a sheet to coordinate it with the corner radius you use elsewhere. People typically expect to resize a sheet when scrolling through its contents or dragging the grabber, which is a small horizontal marker that can appear on the top edge of a sheet. The sheets automatically support the large stop. Adding the middle sheet allows the rest to remain at both heights, while the expanding sheet is stationary at full height. By default, a sheet is modal, presenting a parent experience that blurs the view and prevents interaction with it. After people finish interacting with a modal sheet, they ignore it, or it closes automatically, before resuming activity in the main view.
it: Uno sheet aiuta le persone a svolgere un'attività distinta correlata alla vista genitore senza allontanarle dal contesto corrente, Ad esempio, Mail utilizza un sheet per aiutare le persone a comporre un'e-mail senza lasciare la propria casella di posta. Un sheet appare come una scheda che copre parzialmente il contenuto sottostante. Gli angoli superiori della scheda sono arrotondati per distinguerla visivamente dalla vista principale, possiamo personalizzare il raggio dell’angolo di un sheet per coordinarlo con i raggi dell’angolo che usi altrove. Le persone in genere si aspettano di ridimensionare un sheet quando ne scorrono il contenuto o trascinano il grabber, che è un piccolo indicatore orizzontale che può apparire sul bordo superiore di un sheet. Gli sheets supportano automaticamente il fermo di grandi dimensioni. L'aggiunta del fermo medio consente al sheet di riposare a entrambe le altezze, mentre specificando solo medio si impedisce che il sheet si espanda a tutta altezza. Per impostazione predefinita, un sheet è modale, presentando un'esperienza mirata che offusca la vista padre e previene l'interazione con essa. Dopo che le persone hanno finito di interagire con un sheet modale, lo ignorano, o si chiude automaticamente, prima di riprendere l'attività nella vista principale.

# Sheets2
source: Use a sheet for non-engaging content and simple tasks. A sheet allows part of the main view to remain visible behind it, helping people retain their original context as they interact with the sheet. Use a full-screen modal slideshow to deliver engaging content such as videos, photos, or camera views, Full-screen modal style covers the entire screen, minimizing visual distraction. Consider supporting medium stop to allow for progressive disclosure of sheet content. For example, a sharing sheet shows the most relevant elements within the middle stop, where they are visible without scaling; You can also use a modeless sheet when you want to present extra items that people can use without stopping the main activity. When people choose an item on a modeless sheet, the parent view can update in response, providing feedback on the effect of the item and allowing people to continue their activity while the sheet remains on screen. In general, include a grabber in a resizable sheet. A grabber shows people that they can drag the sheet to resize it; they can also touch it to scroll through the latches. Don't display a sheet on top of a popover. While you may see a sheet inside a popover, nothing should appear above a popover (except possibly a warning).
it: Utilizzare un sheet per contenuti non coinvolgenti e attività semplici. Un sheet consente a una parte della vista principale di rimanere visibile dietro di esso, aiutando le persone a mantenere il loro contesto originale mentre interagiscono con il sheet. Usa una presentazione modale a schermo intero per offrire contenuti coinvolgenti come video, foto o visualizzazioni della fotocamera, Lo stile modale a schermo intero copre l'intero schermo, riducendo al minimo la distrazione visiva. Considerare di supportare il fermo medio per consentire la divulgazione progressiva del contenuto del sheet. Ad esempio, un sheet di condivisione mostra gli elementi più rilevanti all'interno del fermo medio, dove sono visibili senza ridimensionamento. Utilizzare un sheet non modale quando si desidera presentare elementi supplementari che le persone possono utilizzare senza sospendere l'attività principale. Quando le persone scelgono un elemento in un sheet non modale, la vista padre può aggiornarsi in risposta, fornendo feedback sull'effetto dell'elemento e consentendo alle persone di continuare la loro attività mentre il sheet rimane sullo schermo. In generale, includi un grabber in un sheet ridimensionabile. Un grabber mostra alle persone che possono trascinare il sheet per ridimensionarlo; possono anche toccarlo per scorrere i fermi. Non visualizzare un sheet sopra un popover. Sebbene tu possa visualizzare un sheet all'interno di un popover, non dovrebbe apparire nulla sopra un popover (tranne possibilmente un avviso).
