Repository: AntonioEmanueleCutarella98/TheSign
Catalog: TheSign/*.lproj/Localizable.strings
Languages: it

# Buttons2
source: Include subtitles under the button serve to give secondary information of the button such as the number of items for the title add to cart , the subtitles have smaller texts; it is not possible to give titles to give more information about the be useful to make the interface LESS HEAVY enter the states of the use of a button if this does not cause immediate and tangible consequences.
it: Includi sottotitoli sotto il pulsante servono a fornire informazioni secondarie del pulsante come il numero di articoli per il titolo aggiungi al carrello, i sottotitoli hanno testi più piccoli; non è possibile dare titoli per dare maggiori informazioni sul essere utile per far entrare l'interfaccia MENO PESANTE negli stati di utilizzo di un pulsante se questo non provoca conseguenze immediate e tangibili.

# Buttons3
source: A system button can also have a semantic role within the interface; there are several roles:
it: Un pulsante di sistema può anche avere un ruolo semantico all'interno dell'interfaccia; ci sono diversi ruoli:

# Buttons4
source: Normal (no specific meaning), Primary (it is the button that users are expected to use the most, typically in bold), Undo (undo an action performed) and Destroy (button that leads to the destruction of data, typically red). It is essential that once touched the main button I can guarantee an EASY CONFIRM of the choice made; if the button is in a view it is useful for this to close automatically once touched enter and, in general , it is best to avoid assigning a main role to a destructive button even if it is the one that is typically touched the most, this is because people usually tend to touch the buttons just because they are main not because they actually read what is there. A toggle button allows you to switch from one state to another such as on, off or show, hide and this is good to do using different visual styles as in the case of the app Calendary.
it: Normale (nessun significato specifico), Primario (è il pulsante che gli utenti dovrebbero utilizzare di più, tipicamente in grassetto), Annulla (annulla un'azione eseguita) e Distruggi (pulsante che porta alla distruzione dei dati , tipicamente rosso). È fondamentale che una volta toccato il pulsante principale possa garantire una FACILE CONFERMA della scelta effettuata; se il pulsante è in vista è utile che si chiuda automaticamente una volta toccato invio e, in generale, è meglio evitare di assegnare un ruolo principale a un pulsante distruttivo anche se è quello che in genere viene toccato di più, questo perché le persone di solito tendono a toccare i pulsanti solo perché sono principali non perché leggono effettivamente ciò che c'è. il pulsante permette di passare da uno stato all'altro come on, off o mostra, nascondi e questo è bene farlo utilizzando diversi stili visivi come nel caso dell'app Calendary.

# Buttons5
source: When customizing a toggle button it is useful not to rely only on the change of color or a strong contrast between colors but also to help the user with other VISUAL CONTENTS such as: changing the shape of the button or change content. A pop-up button is a type of system button that can display a menu of mutually exclusive options.
it: Quando si personalizza un pulsante di attivazione/disattivazione è utile non fare affidamento solo sul cambio di colore o su un forte contrasto tra i colori ma anche per aiutare l'utente con altri CONTENUTI VISIVI come: cambiare la forma del pulsante o modificare il contenuto . Un pulsante a comparsa è un tipo di pulsante di sistema che può visualizzare un menu di opzioni che si escludono a vicenda.

# Buttons6
source: Use a pop-up button if you need to make people choose from a list of mutually exclusive actions, use a drop-down button instead if you need to allow multiple submenus to be used. A pop-up button always shows the choice made if no one has been made use a default which is the most common one. Usually you use pop-up buttons when you have LITTLE SPACE available and you don't need to always show all the options. A drop-down button is a button that it allows a choice between several actions and closes once the action has been chosen to be able to execute it, or it can be closed by touching elsewhere on the screen. Unlike the pop-up one, it always shows the same choice regardless of the one made by the user.
it: Utilizza un pulsante a comparsa se devi fare in modo che le persone scelgano da un elenco di azioni che si escludono a vicenda, utilizza invece un pulsante a discesa se devi consentire l'utilizzo di più sottomenu. Un pulsante a comparsa sempre mostra la scelta fatta se non è stata fatta nessuno usa un default che è il più comune. Solitamente usi i pulsanti pop-up quando hai POCO SPAZIO a disposizione e non devi mostrare sempre tutte le opzioni. Un menù a tendina button è un pulsante che permette di scegliere tra più azioni e si chiude una volta scelta l'azione per poterla eseguire, oppure può essere chiuso toccando in un altro punto dello schermo.A differenza di quello a comparsa, mostra sempre il stessa scelta indipendentemente da quella operata dall'utente.

# Buttons7
source: Avoid putting all the actions of a view into a single drop-down button. The main actions of a view must be easily FOUND, so you don't want to hide them in a drop-down button. Putting too many actions into a drop-down button it makes it less focused and means that people have to tap at least twice to do anything. Use another key to focus actions that are not prominent in the interface. They require a main view and are placed in the top left.
it: Evita di mettere tutte le azioni di una vista in un unico pulsante a discesa. Le azioni principali di una vista devono essere TROVATE facilmente, quindi non vuoi nasconderle in un pulsante a discesa. Mettere anche molte azioni in un pulsante a discesa lo rende meno focalizzato e significa che le persone devono toccare almeno due volte per fare qualsiasi cosa. Usa un altro tasto per mettere a fuoco le azioni che non sono prominenti nell'interfaccia. Richiedono una vista principale e sono posizionate in in alto a sinistra.

# Buttons8
source: You don't put the delete and done buttons in a view because they both perform the same action, you could instead add a cancel button that allows you to avoid unwanted data loss. There are types of buttons familiar with the user so when using these types of keys you must make sure that they perform the actions that are INTENDED by the user. An example of these keys is the info key
it: Non metti i pulsanti Elimina e Fine in una vista perché entrambi eseguono la stessa azione, puoi invece aggiungere un pulsante Annulla che ti consente di evitare la perdita di dati indesiderata. Esistono tipi di pulsanti che hanno familiarità con il utente quindi quando si utilizzano questi tipi di chiavi è necessario assicurarsi che eseguano le azioni DESTINATE dall'utente. Un esempio di queste chiavi è la chiave info

# Context_menu1
source: Context menus are used to obtain additional features WITHOUT CLUTTERING the interface. Context menus are similar to Peek and Pop, but with two fundamental differences:
it: I menu contestuali vengono utilizzati per ottenere funzionalità aggiuntive SENZA INGOMBRO L'interfaccia. I menu contestuali sono simili a Peek e Pop, ma con due differenze fondamentali:

# Context_menu2
source: Context menus are available on all devices with iOS 13 and later; Peek and Pop is only available on devices that support 3D Touch. Context menus also IMMEDIATELY display contextually relevant commands; Peek and Pop requires an upward swipe to display commands. It is useful to have contextual menus in some parts of the app, not in all so as not to confuse the user, furthermore, in a contextual menu it is not recommended to have many options for choice. It is useful to have contextual menus in some parts of the app, not in all so as not to confuse the user, furthermore, in a contextual menu it is not recommended to have many options for choice.As regards the arrangement of the choices, it is better to put those that you expect can be touched on top, organizing them using separators based on the action (no more than three).
it: I menu contestuali sono disponibili su tutti i dispositivi con iOS 13 e versioni successive; Peek and Pop è disponibile solo su dispositivi che supportano 3D Touch. Anche i menu contestuali visualizzano IMMEDIATAMENTE i comandi pertinenti al contesto; Peek and Pop richiede uno scorrimento verso l'alto per visualizzare i comandi È utile avere dei menu contestuali in alcune parti dell'app, non in tutte per non confondere l'utente, inoltre in un menu contestuale è sconsigliato avere molte opzioni di scelta. È utile avere dei menu contestuali in alcune parti dell'app, non in tutte per non confondere l'utente, inoltre in un menu contestuale è sconsigliato avere molte opzioni di scelta. disposizione dei scelte, è meglio mettere in primo piano quelle che ti aspetti possano essere toccate, organizzandole utilizzando dei separatori in base all'azione (non più di tre).

# Edit_menu1
source: People can tap and hold or double tap an item in a text field, text view, web view or image view to select content and view editing options, such as Copy and Paste. By default, options include Cut, Copy, Paste, Select, Select All and Delete commands. Adjust the position of the editing options if needed. Although you cannot change the shape of the menu, its position is configurable: you can prevent it from covering important content or parts of the interface. Do not implement other controls with the same functionality as the edit menu as someone may change their mind after performing an operation, so it is recommended that you always implement undo and redo support. Minimize the number of custom commands so you don't overwhelm people with too many choices.
it: Le persone possono toccare e tenere premuto o toccare due volte un elemento in un campo di testo, una visualizzazione testo, una visualizzazione Web o una visualizzazione immagine per selezionare il contenuto e visualizzare le opzioni di modifica, come Copia e Incolla. Per impostazione predefinita, le opzioni includono i comandi Taglia, Copia, Incolla, Seleziona, Seleziona tutto ed Elimina. Regola la posizione delle opzioni di modifica, se necessario. Sebbene non sia possibile modificare la forma del menu, la sua posizione è configurabile: è possibile impedire che copra contenuti importanti o parti dell'interfaccia. Non implementare altri controlli con la stessa funzionalità del menu di modifica poiché qualcuno potrebbe cambiare idea dopo aver eseguito un'operazione, è quindi consigliato implementare sempre il supporto annulla e ripristina. Riduci al minimo il numero di comandi personalizzati per non sopraffare le persone con troppe scelte.

# Labels1
source: A label describes an on-screen interface element or provides a short message. Keep your labels legible by better adopting the DYNAMIC type so that your labels still look good when a user changes the text size on their device.
it: Un'etichetta descrive un elemento dell'interfaccia su schermo o fornisce un breve messaggio. Mantieni leggibili le etichette adottando meglio il tipo DINAMICO in modo che le tue etichette abbiano ancora un bell'aspetto quando un utente modifica la dimensione del testo sul proprio dispositivo.

# Page_controls1
source: Page controls do not help people view or navigate pages in a hierarchy or non-linear arrangement. Page controls can handle any number of pages, making them particularly useful in situations where people can create custom LISTS. A page control can adjust the appearance of the indicators to provide more information about the list. People interact with the controls on the page by tapping or swiping (to scroll, people tap the control and drag left or right). Tapping the start or end side of the current page indicator displays the next page or earlier.
it: I controlli di pagina non aiutano le persone a visualizzare o navigare le pagine in una gerarchia o in una disposizione non lineare. I controlli di pagina possono gestire un numero qualsiasi di pagine, il che li rende particolarmente utili nelle situazioni in cui le persone possono creare ELENCHI personalizzati. Un controllo di pagina può regolare l'aspetto degli indicatori per fornire maggiori informazioni sull'elenco. Le persone interagiscono con i controlli sulla pagina toccando o scorrendo (per scorrere, le persone toccano il controllo e trascinano a sinistra o a destra). Toccando il lato iniziale o finale del l'indicatore di pagina mostra la pagina successiva o precedente.

# Page_controls2
source: When you include a list view, you give people an ALTERNATIVE WAY to find the page they want and you can also allow them to reorder the list. Do not use animations while scrolling, people can scroll very quickly so the animation would be useless. A page control can have different background styles: Automatic (Use this style when the page control is not the main navigation element in the user interface) , Prominent (Use this style only when the control is the primary navigation control on the screen) and Minimum (Use this style when you just want to show the current page position in the list and don't need to provide visual feedback when scrubbing. Center the page control at the bottom of the screen).
it: Quando includi una visualizzazione elenco, offri alle persone un MODO ALTERNATIVO per trovare la pagina che desiderano e puoi anche consentire loro di riordinare l'elenco. Non utilizzare animazioni durante lo scorrimento, le persone possono scorrere molto rapidamente in modo che l'animazione sarebbe inutile. Un controllo di pagina può avere stili di sfondo diversi: Automatico (utilizzare questo stile quando il controllo di pagina non è l'elemento di navigazione principale nell'interfaccia utente) , Prominente (utilizzare questo stile solo quando il controllo è il controllo di navigazione principale sull'interfaccia utente) schermo) e Minimo (usa questo stile quando vuoi solo mostrare la posizione corrente della pagina nell'elenco e non è necessario fornire un feedback visivo durante lo scorrimento. Centrare il controllo della pagina nella parte inferiore dello schermo).

# Progress_indicator1
source: Use the activity indicators and progress bars to let people know that your app is not in STALL and to give them an idea of ​​how long they will wait. There are different types of indicators:
it: Usa gli indicatori di attività e le barre di avanzamento per far sapere alle persone che la tua app non è in STALLO e per dare loro un'idea di quanto tempo aspetteranno. Esistono diversi tipi di indicatori :

# Progress_indicator2
source: Activity indicators: they run while an action is being performed.
it: Indicatori di attività:girano mentre viene eseguita un’azione.FOTO

# Progress_indicator3
source: Keep activity indicators moving. People associate a stationary activity indicator with a stalled process. Keep spinning so they know something is happening.
it: Mantieni gli indicatori di attività in movimento. Le persone associano un indicatore di attività stazionaria a un processo in stallo. Continua a girare in modo che sappiano che sta succedendo qualcosa.

# Progress_indicator4
source: Progress bar: A progress bar includes a bar that fills from left to right to show the progress of a task with a known duration. Progress bars are not interactive, although they are often accompanied by a button to cancel the corresponding operation.
it: Progress Bar : una Progress Bar include una barra che si riempie da sinistra a destra per mostrare l'avanzamento di un'attività con una durata nota. Le barre di avanzamento non sono interattive, sebbene siano spesso accompagnate da un pulsante per annullare l'operazione corrispondente.FOTO

# Progress_indicator5
source: Network activity indicator: A network activity indicator rotates in the status bar at the top of the screen when the network occurs. It disappears when the network is complete. This indicator looks like a activity and is not interactive.
it: Indicatore di attività di rete:un indicatore di attività di rete ruota nella Status Bar nella parte superiore dello schermo quando si verifica la rete. Scompare quando la rete è completa. Questo indicatore ha l'aspetto di un indicatore di attività e non è interattivo.FOTO

# Refresh_content_control1
source: A refresh control is a specialized type of activity indicator, it is hidden by default and becomes visible when you drag down the view to reload. Perform automatic content updates so users are not responsible for initiating each update. Keep your data up to date by updating it regularly.
it: Un controllo di aggiornamento è un tipo specializzato di indicatore di attività, è nascosto per impostazione predefinita e diventa visibile quando si trascina verso il basso la vista da ricaricare. Esegui aggiornamenti automatici dei contenuti per non rendere gli utenti responsabili dell'avvio di ogni aggiornamento. Mantieni i dati aggiornati aggiornandoli regolarmente.

# Segmented_control1
source: A segmented control is a linear set of two or more segments, each of which functions as a mutually exclusive button. Within the control, all segments have the same width. Limit the number of segments to improve USABILITY; on iPhone, a segmented control should have five or fewer segments. Avoid mixing text and images into a segmented control, as it can lead to a confusing interface and disconnected.
it: Un controllo segmentato è un insieme lineare di due o più segmenti, ognuno dei quali funziona come un pulsante che si escludono a vicenda. All'interno del controllo, tutti i segmenti hanno la stessa larghezza. Limita il numero di segmenti per migliorare L’USABILITA’; su iPhone, un controllo segmentato dovrebbe avere cinque o meno segmenti. Evita di mescolare testo e immagini in un controllo segmentato, perchè può portare a un’interfaccia confusa e disconnessa.

# Slider1
source: A slider is a horizontal track with a control called a bar, which you can slide with your finger to move between a minimum and maximum value, such as the brightness level of the screen. The appearance of a slider can be adjusted to blend with the app design and to communicate intent.
it: Un dispositivo di scorrimento è una traccia orizzontale con un controllo chiamato barra, che puoi scorrere con il dito per spostarti tra un valore minimo e massimo, come il livello di luminosità dello schermo. L'aspetto di un dispositivo di scorrimento può essere adattato per integrarsi con il design dell'app e per comunicare l'intento.

# Stepper1
source: A stepper is a two-segment control used to increase or decrease an incremental value. Make sure people know what value they are changing when they use a stepper, and don't use it when large changes in value are likely.
it: Uno stepper è un controllo a due segmenti utilizzato per aumentare o diminuire un valore incrementale. Assicurati che le persone sappiano quale valore stanno modificando quando usano uno stepper e non usarlo quando sono probabili grandi variazioni di valore .

# Switch1
source: A switch is a visual switch between two mutually exclusive states: on and off. Consider coloring a switch to match the style of your app. The switches are either on or off. Providing labels describing these states is redundant and clutters the interface.
it: Un interruttore è un interruttore visivo tra due stati che si escludono a vicenda: acceso e spento. Prendi in considerazione la possibilità di colorare un interruttore in modo che corrisponda allo stile dell'app. Gli interruttori possono essere attivati ​​o disattivati. Fornire etichette che descrivono questi stati è ridondante e crea confusione l'interfaccia.

# Text_field1
source: A text field is a single-line, fixed-height field that automatically causes a keyboard to appear when people touch it. Use a text field to request a small amount of information, such as a name or email address.
it: Un campo di testo è un campo a riga singola ad altezza fissa che fa apparire automaticamente una tastiera quando le persone lo toccano. Utilizza un campo di testo per richiedere una piccola quantità di informazioni, come un nome o un indirizzo email.

# QuizTheory
source: Theory
it: Teoria

# QuizNextQuestion
source: Next
it: Successiva

# QuizTimeDescription
source: Select the correct answer to each of the following questions.
it: Seleziona la risposta corretta a ciascuna delle seguenti domande.

# QuizTimeLetsGo
source: Let's Go!
it: Iniziamo!

# QuizScore
source: Final Score:
it: Punteggio finale:

# QuizGrade
source: Letter Grade:
it: Voto finale:

# QuizTimeElapsed
source: Total time:
it: Tempo totale:

# QuizRestart
source: Re-take Quiz
it: Ripeti quiz

# Question1_1
source: What are the 3 main features that differentiate iOS from others?
it: Quali sono le 3 funzioni principali che differenziano iOS dagli altri?

# Question2_1
source: Why are metaphors used?
it: Perché vengono utilizzate le metafore?

# Question3_1
source: What are the main categories of iOS Essentials?
it: Quali sono le categorie principali di iOS Essentials?

# Question4_1
source: Where can we find the Navigation Bar?
it: Dove possiamo trovare la barra di navigazione?

# Answer1_1
source: Clarity, deference and depth.
it: Chiarezza, deferenza e profondità.

# Answer1_2
source: Clarity and consistency.
it: Chiarezza e coerenza.

# Answer1_3
source: Depth, consistency, metaphors.
it: Profondità, consistenza, metafore.

# Answer2_1
source: To split two images.
it: Per dividere due immagini.

# Answer2_2
source: To help the user.
it: Per aiutare l'utente.

# Answer2_3
source: To make an app more fun.
it: Per rendere un'app più divertente.

# Answer3_1
source: Views.
it: Viste.

# Answer3_2
source: Icons, bars.
it: Icone, barre.

# Answer3_3
source: Views, icons, bars.
it: Viste, icone, barre.

# Answer4_1
source: At the top of the app
it: In cima all'app

# Answer4_2
source: At the bottom of the app
it: In fondo all'app

# Answer4_3
source: To the right side of the app
it: A destra dell'app

# Answer4_4
source: To the left side of the app.
it: A sinistra dell'app.

# NoAnswer
source: None of these.
it: Nessuna di queste.
